app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @schoolclasses = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Cooking"], ["room_number", 22], ["created_at", "2020-12-12 23:08:43.562403"], ["updated_at", "2020-12-12 23:08:43.562403"]]
---
    def create
        @schoolclass = SchoolClass.create(school_class_params)